# Chapter 7 - Data Cleaning & Preparation (p.191-219)

## 7.1 Handling Missing Data (p.191)

In [4]:
import pandas as pd
import numpy as np
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [5]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [6]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [7]:
string_data[0] = None

In [8]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

## Filtering Out Missing Data (p.193)

In [10]:
from numpy import nan as NA

In [11]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [12]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [13]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [14]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                    [NA, NA, NA], [NA, 6.5, 3.]])

In [15]:
cleaned = data.dropna()

In [16]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [17]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [18]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [19]:
data[4] = NA

In [20]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [21]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [22]:
df = pd.DataFrame(np.random.randn(7, 3))

In [23]:
df.iloc[:4, 1] = NA

In [24]:
df.iloc[:2, 2] = NA

In [25]:
df

          0         1         2
0 -0.240436       NaN       NaN
1 -1.470470       NaN       NaN
2  1.471440       NaN -0.332433
3 -0.497475       NaN -1.484976
4  0.437226 -1.132180  0.825380
5  1.473299  0.729081  0.607224
6 -0.608030 -0.176880 -1.727362

In [26]:
df.dropna()

          0         1         2
4  0.437226 -1.132180  0.825380
5  1.473299  0.729081  0.607224
6 -0.608030 -0.176880 -1.727362

In [27]:
df.dropna(thresh=2)

          0         1         2
2  1.471440       NaN -0.332433
3 -0.497475       NaN -1.484976
4  0.437226 -1.132180  0.825380
5  1.473299  0.729081  0.607224
6 -0.608030 -0.176880 -1.727362

## Filling in Missing Data (p. 195)

In [28]:
df.fillna(0)

          0         1         2
0 -0.240436  0.000000  0.000000
1 -1.470470  0.000000  0.000000
2  1.471440  0.000000 -0.332433
3 -0.497475  0.000000 -1.484976
4  0.437226 -1.132180  0.825380
5  1.473299  0.729081  0.607224
6 -0.608030 -0.176880 -1.727362

In [29]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.240436  0.500000  0.000000
1 -1.470470  0.500000  0.000000
2  1.471440  0.500000 -0.332433
3 -0.497475  0.500000 -1.484976
4  0.437226 -1.132180  0.825380
5  1.473299  0.729081  0.607224
6 -0.608030 -0.176880 -1.727362

In [30]:
_ = df.fillna(0, inplace=True)

In [31]:
df

          0         1         2
0 -0.240436  0.000000  0.000000
1 -1.470470  0.000000  0.000000
2  1.471440  0.000000 -0.332433
3 -0.497475  0.000000 -1.484976
4  0.437226 -1.132180  0.825380
5  1.473299  0.729081  0.607224
6 -0.608030 -0.176880 -1.727362

In [32]:
df = pd.DataFrame(np.random.randn(6, 3))

In [33]:
df.iloc[2:, 1] = NA

In [34]:
df.iloc[4:, 2] = NA

In [35]:
df

          0         1         2
0  0.802377  0.669412 -0.850562
1  1.693357 -0.958077  0.677773
2 -0.963605       NaN  1.064306
3  1.283774       NaN -0.928012
4 -0.516778       NaN       NaN
5  0.215094       NaN       NaN

In [36]:
df.fillna(method='ffill')

          0         1         2
0  0.802377  0.669412 -0.850562
1  1.693357 -0.958077  0.677773
2 -0.963605 -0.958077  1.064306
3  1.283774 -0.958077 -0.928012
4 -0.516778 -0.958077 -0.928012
5  0.215094 -0.958077 -0.928012

In [37]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.802377  0.669412 -0.850562
1  1.693357 -0.958077  0.677773
2 -0.963605 -0.958077  1.064306
3  1.283774 -0.958077 -0.928012
4 -0.516778       NaN -0.928012
5  0.215094       NaN -0.928012

In [38]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [39]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## 7.2 Data Transformation (p.197)

### Removing Duplicates (ibd)

In [40]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                    'k2': [1, 1, 2, 3, 3, 4, 4]})

In [41]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [42]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [43]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [44]:
data['v1'] = range(7)

In [45]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [46]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming Data Using a Function or Mapping (p. 198)

In [47]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                             'Pastrami', 'corned beef', 'Bacon',
                             'pastrami', 'honey ham', 'nova lox'],
                    'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [48]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [49]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [50]:
lowercased = data['food'].str.lower()

In [51]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [52]:
data['animal'] = lowercased.map(meat_to_animal)

In [53]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [54]:
data['animal'] = lowercased.map(meat_to_animal)

In [55]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [56]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### Replacing Values (p. 200)

In [57]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [58]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [59]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [60]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [61]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [62]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### Renaming Axis Indexes (p.201)

In [63]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                   index=['Ohio', 'Colorado', 'New York'],
                   columns=['one', 'two', 'three', 'four'])

In [64]:
transform = lambda x: x[:4].upper()

In [65]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [66]:
data.index = data.index.map(transform)

In [67]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [68]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [69]:
data.rename(index={'OHIO': 'INDIANA'},
           columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [70]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

In [71]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

## Discretization and Binning (p. 203)

In [72]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [73]:
bins = [18, 25, 35, 60, 100]

In [74]:
cats = pd.cut(ages, bins)

In [75]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [76]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [77]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [78]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [79]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [80]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [81]:
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [82]:
data = np.random.rand(20)

In [83]:
pd.cut(data, 4, precision=2)

[(0.44, 0.66], (0.44, 0.66], (0.0018, 0.22], (0.0018, 0.22], (0.66, 0.88], ..., (0.0018, 0.22], (0.66, 0.88], (0.0018, 0.22], (0.0018, 0.22], (0.66, 0.88]]
Length: 20
Categories (4, interval[float64]): [(0.0018, 0.22] < (0.22, 0.44] < (0.44, 0.66] < (0.66, 0.88]]

In [84]:
data = np.random.randn(1000) # Normally distributed

In [85]:
cats = pd.qcut(data, 4) # Cut into quartiles

In [86]:
cats

[(0.684, 3.203], (0.0509, 0.684], (0.684, 3.203], (-0.686, 0.0509], (-2.82, -0.686], ..., (-2.82, -0.686], (0.0509, 0.684], (-0.686, 0.0509], (0.684, 3.203], (0.0509, 0.684]]
Length: 1000
Categories (4, interval[float64]): [(-2.82, -0.686] < (-0.686, 0.0509] < (0.0509, 0.684] < (0.684, 3.203]]

In [87]:
pd.value_counts(cats)

(0.684, 3.203]      250
(0.0509, 0.684]     250
(-0.686, 0.0509]    250
(-2.82, -0.686]     250
dtype: int64

In [88]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(1.28, 3.203], (0.0509, 1.28], (1.28, 3.203], (-1.276, 0.0509], (-1.276, 0.0509], ..., (-2.82, -1.276], (0.0509, 1.28], (-1.276, 0.0509], (0.0509, 1.28], (0.0509, 1.28]]
Length: 1000
Categories (4, interval[float64]): [(-2.82, -1.276] < (-1.276, 0.0509] < (0.0509, 1.28] < (1.28, 3.203]]

### Detecting and Filtering Outliers (p. 205)

In [89]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [90]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.047875    -0.094397     0.013252     0.033168
std       0.985818     0.975492     1.001694     1.035331
min      -3.144384    -3.006394    -3.355544    -4.196270
25%      -0.673580    -0.803300    -0.669968    -0.623863
50%      -0.012408    -0.100542     0.038188     0.036747
75%       0.575176     0.591897     0.678675     0.735898
max       3.522209     2.576605     3.432231     3.205035